
#### Terraform Format 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`

<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.azurerm_resource_group.mine_server_rg: Reading...
data.azurerm_resource_group.mine_server_rg: Read complete after 0s [id=/subscriptions/b821accf-bbb0-45ec-bdc4-ad636e374794/resourceGroups/mine-server-rg]
data.azurerm_storage_account.mine_server_storage: Reading...
data.azurerm_storage_account.mine_server_storage: Read complete after 1s [id=/subscriptions/b821accf-bbb0-45ec-bdc4-ad636e374794/resourceGroups/mine-server-rg/providers/Microsoft.Storage/storageAccounts/mineserversa]
azurerm_storage_share.mine_file_share: Refreshing state... [id=https://mineserversa.file.core.windows.net/mineserverfileshare]
azurerm_container_group.mine_server: Refreshing state... [id=/subscriptions/b821accf-bbb0-45ec-bdc4-ad636e374794/resourceGroups/mine-server-rg/providers/Microsoft.ContainerInstance/containerGroups/mine-server]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_container_group.mine_server will be replaced, as requested
-/+ resource "azurerm_container_group" "mine_server" {
      ~ exposed_port                = [
          - {
              - port     = 25565
              - protocol = "TCP"
            },
          - {
              - port     = 25575
              - protocol = "TCP"
            },
          - {
              - port     = 445
              - protocol = "TCP"
            },
        ] -> (known after apply)
      ~ fqdn                        = "folly-mine-server.brazilsouth.azurecontainer.io" -> (known after apply)
      ~ id                          = "/subscriptions/b821accf-bbb0-45ec-bdc4-ad636e374794/resourceGroups/mine-server-rg/providers/Microsoft.ContainerInstance/containerGroups/mine-server" -> (known after apply)
      ~ ip_address                  = "4.228.155.78" -> (known after apply)
        name                        = "mine-server"
      + network_profile_id          = (known after apply)
      - subnet_ids                  = [] -> null
      - tags                        = {} -> null
      - zones                       = [] -> null
        # (8 unchanged attributes hidden)

      ~ container {
          ~ commands                     = [] -> (known after apply)
          - cpu_limit                    = 0 -> null
          ~ environment_variables        = { # forces replacement
              - "MODRINTH_LOADER"   = "fabric" -> null
              + "MODRINTH_MODPACK"  = "https://modrinth.com/modpack/cobblemon-fabric/version/1.5"
              - "MODRINTH_PROJECTS" = "fabric-api,cobblemon,journeymap" -> null
              + "MOD_PLATFORM"      = "MODRINTH"
                # (7 unchanged elements hidden)
            }
          - memory_limit                 = 0 -> null
            name                         = "mine-container"
          - secure_environment_variables = (sensitive value) -> null
            # (3 unchanged attributes hidden)

          ~ volume {
                name                 = "mine-volume"
              - secret               = (sensitive value) -> null
                # (6 unchanged attributes hidden)
            }

            # (3 unchanged blocks hidden)
        }
    }

  # azurerm_storage_share.mine_file_share will be replaced, as requested
-/+ resource "azurerm_storage_share" "mine_file_share" {
      ~ access_tier          = "TransactionOptimized" -> (known after apply)
      ~ id                   = "https://mineserversa.file.core.windows.net/mineserverfileshare" -> (known after apply)
      ~ metadata             = {} -> (known after apply)
        name                 = "mineserverfileshare"
      ~ resource_manager_id  = "/subscriptions/b821accf-bbb0-45ec-bdc4-ad636e374794/resourceGroups/mine-server-rg/providers/Microsoft.Storage/storageAccounts/mineserversa/fileServices/default/fileshares/mineserverfileshare" -> (known after apply)
      ~ url                  = "https://mineserversa.file.core.windows.net/mineserverfileshare" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @mfollypp, Action: `pull_request`, Workflow: `Terraform`*